export interface Governorate {
  name: string;
  cities: string[];
}

export const EGYPT: Governorate[] = [
  {
    name: "القاهرة",
    cities: [
      "مدينة نصر",
      "مصر الجديدة",
      "التجمع",
      "المعادي",
      "حلوان",
      "عين شمس",
      "شبرا",
      "الزيتون",
      "مدينة السلام",
      "المرج",
      "النزهة",
      "وسط البلد",
      "المقطم",
      "الشروق",
      "بدر",
      "15 مايو",
      "القاهرة الجديدة"
    ]
  },

  {
    name: "الجيزة",
    cities: [
      "الدقي",
      "المهندسين",
      "الهرم",
      "فيصل",
      "العجوزة",
      "إمبابة",
      "بولاق الدكرور",
      "6 أكتوبر",
      "الشيخ زايد",
      "الصف",
      "أوسيم",
      "البدرشين"
    ]
  },

  {
    name: "الإسكندرية",
    cities: [
      "سيدي جابر",
      "سموحة",
      "العجمي",
      "المنتزه",
      "العطارين",
      "محرم بك",
      "برج العرب"
    ]
  }

  // هنضيف باقي المحافظات بعد كده
];